src/Documents/НачислениеПениПоЗадолженности/НачислениеПениПоЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПениПоЗадолженности</name>
  <registerRecords>AccumulationRegister.ОстаткиПениСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачисленнаяПеня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиПениСтудентов/ОстаткиПениСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПениСтудентов</name>
  <resources>
    <name>СуммаПени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/РегистрОпераций/РегистрОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрОпераций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТипОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/НачислениеПениПоЗадолженности/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиПениСтудентов
	Движения.ОстаткиПениСтудентов.Записывать = Истина;
	Движение = Движения.ОстаткиПениСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Студент = Студент;
	Движение.СуммаПени = НачисленнаяПеня;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	ЗаписьОперации = РегистрыСведений.РегистрОпераций.СоздатьМенеджерЗаписи();
	ЗаписьОперации.Период = Дата;
	ЗаписьОперации.ТипОперации = "Начисление пени по задолженности";
	ЗаписьОперации.Студент = Студент;
	ЗаписьОперации.Сумма = НачисленнаяПеня;
	ЗаписьОперации.Записать();
КонецПроцедуры
